RIET/src/DataProcessors/КурсыВалютРБК/КурсыВалютРБК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КурсыВалютРБК</name>
  <comment>Загрузка курсов валют с сайта РБК</comment>
  <attributes>
    <name>НачДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВалют</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

RIET/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/DataProcessors/КурсыВалютРБК/ObjectModule.bsl
Перем ИмяФайла;

#Если Клиент Тогда

// Выделяет из переданной строки первое значение
 //  до символа "TAB"
 //
 // Параметры: 
 //  ИсходнаяСтрока - Строка - строка для разбора
 //
 // Возвращаемое значение:
 //  подстроку до символа "TAB"
 //
Функция ВыделитьПодСтроку(ИсходнаяСтрока)

	Перем ПодСтрока;
	
    Поз = СтрНайти(ИсходнаяСтрока,Символы.Таб);
	Если Поз > 0 Тогда
		ПодСтрока = Лев(ИсходнаяСтрока,Поз-1);
		ИсходнаяСтрока = Сред(ИсходнаяСтрока,Поз+1);
	Иначе
		ПодСтрока = ИсходнаяСтрока;
		ИсходнаяСтрока = "";
	КонецЕсли;
	
	Возврат ПодСтрока;
 
 КонецФункции // ВыделитьПодСтроку()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит загрузку курсов и кратностей валют с сайта РБК
//
// Параметры:
//  ИндикаторФормы     - ЭлементыФормы типа Индикатор - для отработки индикатора формы
//  НадписьВалютыФормы - ЭлементыФормы типа Надпись  - Для отработки надписи 
//													   загружаемой валюты
//
Процедура ЗагрузитьКурсыСРБК(ИндикаторФормы ,НадписьВалютыФормы ) Экспорт
	
	Перем HTTP;
	
	РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
	ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();

	Текст = Новый ТекстовыйДокумент();

	СерверИсточник = "cbrates.rbc.ru";
	ОбработкаПолученияФайлов = Обработки.ПолучениеФайловИзИнтернета.Создать();

	Адрес1 = "tsv/cb/";  // в интервале
	Адрес2 = "tsv/";     // по 1 дате
	Если НачДата = КонДата Тогда  // по 1 дате
		Адрес = Адрес2;
		ТМП   = "/"+Формат(Год(КонДата),"ЧРГ=; ЧГ=0")+"/"+Формат(Месяц(КонДата),"ЧЦ=2;ЧДЦ=0;ЧВН=")+"/"+Формат(День(КонДата),"ЧЦ=2;ЧДЦ=0;ЧВН=");
	Иначе    // в интервале
		Адрес = Адрес1;
		ТМП   = "";
	КонецЕсли;

	ВремКаталог = КаталогВременныхФайлов() + "tempKurs";
	СоздатьКаталог(ВремКаталог);
	УдалитьФайлы(ВремКаталог,"*.*");
	
	//-> RG-Soft VIvanov 26/01/2015
	ЗагружатьММВБ = Ложь;
	//<-
	Для каждого СтрокаСпВалют из СписокВалют Цикл

		ТекВалюта = СтрокаСпВалют.Валюта;
		//-> RG-Soft VIvanov 26/01/2015
		Если ТекВалюта.Код = "000" Тогда
			ЗагружатьММВБ = Истина;
			Продолжить;
		КонецЕсли;
		//<-
		Стр = "";
		ИмяВходящегоФайла = "" + ВремКаталог + "\" + ИмяФайла;
		СтрокаПараметраПолучения = Адрес + Прав(ТекВалюта.Код,3) + ТМП + ".tsv";
		Если ОбработкаПолученияФайлов.ЗапроситьФайлыССервера(СерверИсточник, СтрокаПараметраПолучения, ИмяВходящегоФайла, HTTP) <> Истина Тогда
			Сообщить("Не удалось получить ресурс для валюты " + СокрЛП(ТекВалюта.Наименование) + " (код " + ТекВалюта.Код + "). Курс для валюты не загружен."); 
			Продолжить;
		КонецЕсли; 

		ВходящийФайл = Новый Файл(ИмяВходящегоФайла);
		Если НЕ ВходящийФайл.Существует() Тогда
			Сообщить("Не удалось получить ресурс для валюты " + СокрЛП(ТекВалюта.Наименование) + " (код " + ТекВалюта.Код + "). Курс для валюты не загружен."); 
			Продолжить;
		КонецЕсли;	

		Текст.Прочитать(ИмяВходящегоФайла,КодировкаТекста.ANSI);
		
		КолСтрок = Текст.КоличествоСтрок();
		Для Инд = 1 По КолСтрок Цикл
			НадписьВалютыФормы = СокрЛП(ТекВалюта.Наименование);

			ИндикаторФормы = Инд/КолСтрок * 100;
				
			Стр = Текст.ПолучитьСтроку(Инд);
			Если (Стр = "") ИЛИ (Найти(Стр,Символы.Таб) = 0) Тогда
			   Продолжить;
			КонецЕсли;
			Если НачДата = КонДата Тогда  
			   ДатаКурса = КонДата;
			Иначе 
			   ДатаКурсаСтр = ВыделитьПодСтроку(Стр);
			   ДатаКурса    = Дата(Лев(ДатаКурсаСтр,4),Сред(ДатаКурсаСтр,5,2),Сред(ДатаКурсаСтр,7,2));
			КонецЕсли;
			Кратность = Число(ВыделитьПодСтроку(Стр));
			Курс      = Число(ВыделитьПодСтроку(Стр));

			Если ДатаКурса > КонДата Тогда
			   Прервать;
			КонецЕсли;

			Если ДатаКурса < НачДата Тогда 
			   Продолжить;
			КонецЕсли;

            ЗаписьКурсовВалют.Валюта = ТекВалюта;
			ЗаписьКурсовВалют.Период = ДатаКурса;
			ЗаписьКурсовВалют.Прочитать();
			ЗаписьКурсовВалют.Валюта    = ТекВалюта;
			ЗаписьКурсовВалют.Период    = ДатаКурса;
			ЗаписьКурсовВалют.Курс      = Курс;
			ЗаписьКурсовВалют.Кратность = Кратность;
			ЗаписьКурсовВалют.Записать();
		КонецЦикла;	   
	КонецЦикла;	
	УдалитьФайлы(ВремКаталог,"*.*");
	
	//-> RG-Soft VIvanov 26/01/2015
	Если ЗагружатьММВБ Тогда
		//ЗагрузитьАктуальныйКурсММВБ(ИндикаторФормы ,НадписьВалютыФормы);
		ЗагрузитьАктуальныйКурсММВБНовый(ИндикаторФормы ,НадписьВалютыФормы);
	КонецЕсли;
	//<-

КонецПроцедуры // ЗагрузитьКурсыСРБК()

//-> RG-Soft VIvanov 26/01/2015
Процедура ЗагрузитьАктуальныйКурсММВБ(ИндикаторФормы ,НадписьВалютыФормы) Экспорт
		
	текДата = НачДата;
	Валюта = Справочники.Валюты.НайтиПоКоду("000");
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		objIE = Новый COMОбъект("InternetExplorer.Application");
	Исключение
		Сообщить("Не удалось загрузить курс доллара (ММВБ). " + ОписаниеОшибки()); 
		Возврат;
	КонецПопытки;	
	objIE.Visible = Ложь;
	objIE.Silent = Ложь;
	
	НомерПопытки = 0;
	Дней = (КонДата - НачДата)/(24*3600) + 1;
	инд = 1;
	Пока текДата <= НачалоДня(КонДата) И текДата < НачалоДня(ТекущаяДата()) Цикл
		НадписьВалютыФормы = СокрЛП(Валюта.Наименование);
		ИндикаторФормы = Инд/Дней * 100;
		НомерПопытки = НомерПопытки + 1;
		ФорматДаты = Формат(текДата, "Дф = гггг-ММ-дд");
		objIE.Navigate2("http://www.micex.ru/marketdata/quotes?trade_engine=currency&market=selt&data_type=history&date=" + ФорматДаты + "&date_from=" + ФорматДаты + "&board_group_id=13&group_id=9&collection_id=173&type_of_info=short"); 
		Текст = Неопределено;
		
		Попытка
			НачалоЗагрузки = ТекущаяДата();
			Пока objIE.readyState < 4 Цикл // Ждем пока она загрузится
				Если ТекущаяДата() > НачалоЗагрузки + 300 Тогда
					Сообщить("Не удалось загрузить страницу");
					Возврат;
				КонецЕсли;
			КонецЦикла;
			НачалоЗагрузки = ТекущаяДата();
			инд1 = 1;
			Пока ТекущаяДата() < НачалоЗагрузки + 15 Цикл
				инд1 = инд1 + 1;
			КонецЦикла;
			objDoc = objIE.Document;
			ГотовностьДокумента = "";
			Попытка
				ГотовностьДокумента = objDoc.readyState;
			Исключение
			КонецПопытки;
			Если ГотовностьДокумента <> "complete" Тогда
				Инд1 = 1;
				Пока инд1 < 100000 Цикл
					инд1 = инд1 + 1;
				КонецЦикла;
			КонецЕсли;
			Текст =  objDoc.Body.InnerHTML;
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
		
		Если Текст <> Неопределено Тогда
			Текст = нРег(Текст);
			Номер = СтрНайти(Текст, ">информация о торгах<");
			Если Номер = 0 Тогда
				//Если СтрНайти(Текст, "Данные не найдены. Попытайтесь использовать другие параметры поиска") = 0 Тогда
					Сообщить("Не найден средневзвешенный курс доллара за " + ФорматДаты + "! Ошибка разбора данных с сайта");
					текДата = текДата + 24*3600;
					инд = инд + 1;
					НомерПопытки = 0;
					Продолжить;
				//Иначе
				//	ДатаКурсаСтрокой = "31-12-3999";
				//	КурсСтрокой = "";
				//КонецЕсли;
			Иначе
				Текст = Сред(Текст, Номер + 21);
				Номер = СтрНайти(Текст, "instrument-info-date"">");
				Текст = Сред(Текст, Номер + 22);
				Если Лев(Текст, 5) = "ument" Тогда
					Текст = Сред(Текст, 17);
				КонецЕсли;
				ДатаКурсаСтрокой = Лев(Текст, 10);
				КурсСтрокой = "";
			КонецЕсли;
			Попытка
				ДатаКурса = Дата(Прав(ДатаКурсаСтрокой, 4) + Сред(ДатаКурсаСтрокой, 4, 2) + Лев(ДатаКурсаСтрокой, 2) + "000000");
				Если ДатаКурса > текДата Тогда
					ЗаписьКурса = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(текДата, Новый Структура("Валюта", Валюта));
					Курс = ЗаписьКурса.Курс;
				Иначе
					Номер = СтрНайти(Текст, "средневзвешенный курс, единиц сопряж. валюты/единицу валюты лота");
					Если Номер = 0 Тогда
						Сообщить("Не найден средневзвешенный курс доллара за " + ФорматДаты + "!");
						текДата = текДата + 24*3600;
						инд = инд + 1;
						НомерПопытки = 0;
						Продолжить;
					КонецЕсли; 
					Текст = Сред(Текст, Номер + 64);
					Номер = СтрНайти(Текст, "table-info-cell");
					Текст = Сред(Текст, Номер + 15);
					Номер1 = СтрНайти(Текст, ">");
					Номер2 = СтрНайти(Текст, "<");
					КурсСтрокой = Сред(Текст, Номер1 + 1, Номер2 - Номер1 - 1);
					Курс = Число(КурсСтрокой);
				КонецЕсли;
			Исключение
				Сообщить("Ошибка загрузки средневзвешенного курса доллара за " + ФорматДаты + ". " + ОписаниеОшибки());
				Сообщить("Дата курса с сайта - " + ДатаКурсаСтрокой + "; Курс строкой - " + КурсСтрокой);
				текДата = текДата + 24*3600;
				инд = инд + 1;
				НомерПопытки = 0;
				Продолжить;
			КонецПопытки;
			ЗаписьКурсовВалют = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
			ЗаписьКурсовВалют.Валюта    = Валюта;
			ЗаписьКурсовВалют.Период    = текДата;
			ЗаписьКурсовВалют.Прочитать();
			ЗаписьКурсовВалют.Валюта    = Валюта;
			ЗаписьКурсовВалют.Период    = текДата;
			ЗаписьКурсовВалют.Курс      = Курс;
			ЗаписьКурсовВалют.Кратность = 1;
			ЗаписьКурсовВалют.Записать();
		Иначе
			Если НомерПопытки < 4 Тогда
				objIE.Quit();
				objIE = Неопределено;
				Попытка
					objIE = Новый COMОбъект("InternetExplorer.Application");
				Исключение
					Сообщить(ОписаниеОшибки()); 
					Возврат;
				КонецПопытки;	
				objIE.Visible = Ложь;
				objIE.Silent = Ложь;
				Продолжить;
			Иначе
				Сообщить("Ошибка загрузки средневзвешенного курса доллара за " + ФорматДаты + ". " + ОписаниеОшибки);
			КонецЕсли;
		КонецЕсли;
		текДата = текДата + 24*3600;
		инд = инд + 1;
		НомерПопытки = 0;
	КонецЦикла;
	
	objIE.Quit();
	objIE = Неопределено;	
	
КонецПроцедуры
//<-

//-> RG-Soft VIvanov 16/05/2016
Процедура ЗагрузитьАктуальныйКурсММВБНовый(ИндикаторФормы ,НадписьВалютыФормы) Экспорт
		
	текДата = НачДата;
	Валюта = Справочники.Валюты.НайтиПоКоду("000");
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		objIE = Новый COMОбъект("InternetExplorer.Application");
	Исключение
		Сообщить("Не удалось загрузить курс доллара (ММВБ). " + ОписаниеОшибки()); 
		Возврат;
	КонецПопытки;	
	objIE.Visible = Ложь;
	objIE.Silent = Ложь;
	
	НомерПопытки = 0;
	ПродолжатьПопытки = Истина;
	ОписаниеОшибки = "";
	Пока ПродолжатьПопытки Цикл
		Если текДата <= НачалоДня(КонДата) И текДата < НачалоДня(ТекущаяДата()) Тогда
			НадписьВалютыФормы = СокрЛП(Валюта.Наименование);
			НомерПопытки = НомерПопытки + 1;
			Текст = Неопределено;
			objIE.Navigate2("http://moex.com/ru/issue/USD000000TOD/CETS"); 
			Попытка
				НачалоЗагрузки = ТекущаяДата();
				Пока objIE.readyState < 4 Цикл // Ждем пока она загрузится
					Если ТекущаяДата() > НачалоЗагрузки + 300 Тогда
						Сообщить("Не удалось загрузить страницу");
						Возврат;
					КонецЕсли;
				КонецЦикла;
				НачалоЗагрузки = ТекущаяДата();
				инд1 = 1;
				Пока ТекущаяДата() < НачалоЗагрузки + 15 Цикл
					инд1 = инд1 + 1;
				КонецЦикла;
				objDoc = objIE.Document;
				ГотовностьДокумента = "";
				Попытка
					ГотовностьДокумента = objDoc.readyState;
				Исключение
				КонецПопытки;
				Если ГотовностьДокумента <> "complete" Тогда
					Инд1 = 1;
					Пока инд1 < 100000 Цикл
						инд1 = инд1 + 1;
					КонецЦикла;
				КонецЕсли;
				Текст =  objDoc.Body.InnerHTML;
				ПродолжатьПопытки = Ложь;
			Исключение
				Если НомерПопытки < 4 Тогда
					objIE.Quit();
					objIE = Неопределено;
					Попытка
						objIE = Новый COMОбъект("InternetExplorer.Application");
					Исключение
						Сообщить(ОписаниеОшибки()); 
						Возврат;
					КонецПопытки;	
					objIE.Visible = Ложь;
					objIE.Silent = Ложь;
				Иначе
					ОписаниеОшибки = ОписаниеОшибки();
					ПродолжатьПопытки = Ложь;
				КонецЕсли;
			КонецПопытки;
		Иначе
			ПродолжатьПопытки = Ложь;
		КонецЕсли;
	КонецЦикла;
	Если Текст = Неопределено Тогда
		Сообщить("Ошибка загрузки средневзвешенного курса доллара. Ошибка загрузки сайта. " + ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	НомерПопытки = 0;
	Дней = (КонДата - НачДата)/(24*3600) + 1;
	инд = 1;
	текМесяц = НачалоМесяца(ТекущаяДата());
	
	//-> RG-Soft VIvanov 2016/10/04
	КорректировкаМесяцев = 0;
	Попытка
		ТекЭлементы = objIE.Document.getElementsByTagName("INPUT");
		Для инд2= 1 По ТекЭлементы.Length Цикл
			Если ТекЭлементы.Item(инд2 - 1).id = "trading_volumes_date" Тогда
				МесяцСтрокой = ТекЭлементы.Item(инд2 - 1).Value;
				ВыбранныйМесяц = Число(Сред(МесяцСтрокой, 4, 2));
				ВыбранныйГод = Число(Сред(МесяцСтрокой, 7, 4));
				КорректировкаМесяцев = (Год(текМесяц) - ВыбранныйГод) * 12 + Месяц(текМесяц) - ВыбранныйМесяц;
			КонецЕсли;
		КонецЦикла;
	Исключение
	КонецПопытки;
	Если КорректировкаМесяцев <> 0 Тогда
		Попытка
			//-> RG-Soft VIvanov 2017/10/11
			//objIE.Document.getElementsByTagName("IMG").Item(17).Click();
			ТекЭлементы = objIE.Document.getElementsByTagName("IMG");
			Для инд2= 1 По ТекЭлементы.Length Цикл
				Если ТекЭлементы.Item(инд2 - 1).className = "ui-datepicker-trigger" Тогда
					ТекЭлементы.Item(инд2 - 1).Click();
					Прервать;
				КонецЕсли;
			КонецЦикла;
			//<- RG-Soft VIvanov 2017/10/11
			НачалоДоЗагрузки = ТекущаяДата();
			инд1 = 1;
			Пока ТекущаяДата() < НачалоДоЗагрузки + 10 Цикл
				инд1 = инд1 + 1;
			КонецЦикла;
			Если КорректировкаМесяцев < 0 Тогда
				Для Месяцев = 1 По - КорректировкаМесяцев Цикл
					ТекЭлементы = objIE.Document.getElementsByTagName("SPAN");
					Для инд2= 1 По ТекЭлементы.Length Цикл
						Если ТекЭлементы.Item(инд2 - 1).OuterHTML = "<span class=""ui-icon ui-icon-circle-triangle-w"">&lt;Пред</span>" 
							Или ТекЭлементы.Item(инд2 - 1).OuterHTML = "<SPAN class=""ui-icon ui-icon-circle-triangle-w"">&lt;Пред</SPAN>" Тогда
							ТекЭлементы.Item(инд2 - 1).Click();
							инд1 = 1;
							Пока ТекущаяДата() < НачалоДоЗагрузки + 10 Цикл
								инд1 = инд1 + 1;
							КонецЦикла;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			Иначе
				Для Месяцев = 1 По КорректировкаМесяцев Цикл
					ТекЭлементы = objIE.Document.getElementsByTagName("SPAN");
					Для инд2= 1 По ТекЭлементы.Length Цикл
						Если ТекЭлементы.Item(инд2 - 1).OuterHTML = "<span class=""ui-icon ui-icon-circle-triangle-e"">След&gt;</span>" 
							Или ТекЭлементы.Item(инд2 - 1).OuterHTML = "<SPAN class=""ui-icon ui-icon-circle-triangle-e"">След&gt;</SPAN>" Тогда
							ТекЭлементы.Item(инд2 - 1).Click();
							НачалоДоЗагрузки = ТекущаяДата();
							инд1 = 1;
							Пока ТекущаяДата() < НачалоДоЗагрузки + 10 Цикл
								инд1 = инд1 + 1;
							КонецЦикла;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			текДень = Строка(День(ТекущаяДата()));
			ТекЭлементы = objIE.Document.getElementsByTagName("A");
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить("<a class=""ui-state-default"" href=""#"">" + текДень + "</a>");
			МассивСтрок.Добавить("<A class=ui-state-default href=""#"">" + текДень + "</A>");
			МассивСтрок.Добавить("<A class=""ui-state-default ui-state-active"" href=""#"">" + текДень + "</A>");
			МассивСтрок.Добавить("<A class=""ui-state-default ui-state-highlight"" href=""#"">" + текДень + "</A>");
			МассивСтрок.Добавить("<A class=""ui-state-default ui-state-highlight ui-state-hover"" href=""#"">" + текДень + "</A>");
			Для инд2 = 1 По ТекЭлементы.Length Цикл
				Если МассивСтрок.Найти(ТекЭлементы.Item(инд2 - 1).OuterHTML) <> Неопределено Тогда
					ТекЭлементы.Item(инд2 - 1).Click();
					НачалоДоЗагрузки = ТекущаяДата();
					инд1 = 1;
					Пока ТекущаяДата() < НачалоДоЗагрузки + 15 Цикл
						инд1 = инд1 + 1;
					КонецЦикла;
					ГотовностьДокумента = Неопределено;
					Попытка
						ГотовностьДокумента = objDoc.readyState;
					Исключение
					КонецПопытки;
					Если ГотовностьДокумента <> "complete" Тогда
						НачалоДоЗагрузки = ТекущаяДата();
						инд1 = 1;
						Пока ТекущаяДата() < НачалоДоЗагрузки + 15 Цикл
							инд1 = инд1 + 1;
						КонецЦикла;
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Исключение
		КонецПопытки;
	КонецЕсли;
	//<- RG-Soft VIvanov 2016/10/04
			
	Пока текДата <= НачалоДня(КонДата) И текДата < НачалоДня(ТекущаяДата()) Цикл
		ИндикаторФормы = Инд/Дней * 100;
		НомерПопытки = НомерПопытки + 1;
		ФорматДаты = Формат(текДата, "Дф = гггг-ММ-дд");
		Текст = Неопределено;
		
		Попытка
			//-> RG-Soft VIvanov 2017/10/11
			//objIE.Document.getElementsByTagName("IMG").Item(17).Click();
			ТекЭлементы = objIE.Document.getElementsByTagName("IMG");
			Для инд2= 1 По ТекЭлементы.Length Цикл
				Если ТекЭлементы.Item(инд2 - 1).className = "ui-datepicker-trigger" Тогда
					ТекЭлементы.Item(инд2 - 1).Click();
					Прервать;
				КонецЕсли;
			КонецЦикла;
			//<- RG-Soft VIvanov 2017/10/11
			НачалоДоЗагрузки = ТекущаяДата();
			инд1 = 1;
			Пока ТекущаяДата() < НачалоДоЗагрузки + 10 Цикл
				инд1 = инд1 + 1;
			КонецЦикла;
			Если НачалоМесяца(текДата) <> текМесяц Тогда
				Если НачалоМесяца(текДата) < текМесяц Тогда
					МесяцевНазад = (Год(текМесяц) - Год(текДата)) * 12 + Месяц(текМесяц) - Месяц(текДата);
					Для Месяцев = 1 По МесяцевНазад Цикл
						ТекЭлементы = objIE.Document.getElementsByTagName("SPAN");
						Для инд2= 1 По ТекЭлементы.Length Цикл
							Если ТекЭлементы.Item(инд2 - 1).OuterHTML = "<span class=""ui-icon ui-icon-circle-triangle-w"">&lt;Пред</span>" 
								Или ТекЭлементы.Item(инд2 - 1).OuterHTML = "<SPAN class=""ui-icon ui-icon-circle-triangle-w"">&lt;Пред</SPAN>" Тогда
								ТекЭлементы.Item(инд2 - 1).Click();
								НачалоДоЗагрузки = ТекущаяДата();
								инд1 = 1;
								Пока ТекущаяДата() < НачалоДоЗагрузки + 10 Цикл
									инд1 = инд1 + 1;
								КонецЦикла;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				Иначе
					МесяцевВперед = (Год(текДата) - Год(текМесяц)) * 12 + Месяц(текДата) - Месяц(текМесяц);
					Для Месяцев = 1 По МесяцевВперед Цикл
						ТекЭлементы = objIE.Document.getElementsByTagName("SPAN");
						Для инд2= 1 По ТекЭлементы.Length Цикл
							Если ТекЭлементы.Item(инд2 - 1).OuterHTML = "<span class=""ui-icon ui-icon-circle-triangle-e"">След&gt;</span>" 
								Или ТекЭлементы.Item(инд2 - 1).OuterHTML = "<SPAN class=""ui-icon ui-icon-circle-triangle-e"">След&gt;</SPAN>" Тогда
								ТекЭлементы.Item(инд2 - 1).Click();
								НачалоДоЗагрузки = ТекущаяДата();
								инд1 = 1;
								Пока ТекущаяДата() < НачалоДоЗагрузки + 10 Цикл
									инд1 = инд1 + 1;
								КонецЦикла;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
				текМесяц = НачалоМесяца(текДата);
			КонецЕсли;
			текДень = Строка(День(текДата));
			ТекЭлементы = objIE.Document.getElementsByTagName("A");
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить("<a class=""ui-state-default"" href=""#"">" + текДень + "</a>");
			МассивСтрок.Добавить("<A class=ui-state-default href=""#"">" + текДень + "</A>");
			МассивСтрок.Добавить("<A class=""ui-state-default ui-state-active"" href=""#"">" + текДень + "</A>");
			МассивСтрок.Добавить("<A class=""ui-state-default ui-state-highlight"" href=""#"">" + текДень + "</A>");
			МассивСтрок.Добавить("<A class=""ui-state-default ui-state-highlight ui-state-hover"" href=""#"">" + текДень + "</A>");
			Для инд2 = 1 По ТекЭлементы.Length Цикл
				Если МассивСтрок.Найти(ТекЭлементы.Item(инд2 - 1).OuterHTML) <> Неопределено Тогда
					ТекЭлементы.Item(инд2 - 1).Click();
					НачалоДоЗагрузки = ТекущаяДата();
					инд1 = 1;
					Пока ТекущаяДата() < НачалоДоЗагрузки + 15 Цикл
						инд1 = инд1 + 1;
					КонецЦикла;
					ГотовностьДокумента = Неопределено;
					Попытка
						ГотовностьДокумента = objDoc.readyState;
					Исключение
					КонецПопытки;
					Если ГотовностьДокумента <> "complete" Тогда
						НачалоДоЗагрузки = ТекущаяДата();
						инд1 = 1;
						Пока ТекущаяДата() < НачалоДоЗагрузки + 15 Цикл
							инд1 = инд1 + 1;
						КонецЦикла;
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Текст =  objDoc.Body.InnerHTML;
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
		
		ЭтоIE8 = Ложь;
		Если Текст <> Неопределено Тогда
			НетТоргов = Ложь;
			Текст = нРег(Текст);
			Номер = Найти(Текст, "<div class=""issue_export");
			Если Номер = 0 Тогда
				Номер = Найти(Текст, "<div class=issue_export");
				ЭтоIE8 = Истина;
			КонецЕсли;
			КурсСтрокой = "";
			Если Номер = 0 Тогда
				Сообщить("Не найден средневзвешенный курс доллара за " + ФорматДаты + "! Ошибка разбора данных с сайта");
				текДата = текДата + 24*3600;
				инд = инд + 1;
				НомерПопытки = 0;
				Продолжить;
			Иначе
				ТекстНетТоргов = Сред(Текст, Номер, 57);
				Если ТекстНетТоргов = "<div class=""issue_export ng-hide"" data-ng-show=""hasdata"">" Тогда
					НетТоргов = Истина;
				КонецЕсли;
			КонецЕсли;
			Попытка
				Если НетТоргов Тогда
					ЗаписьКурса = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(текДата, Новый Структура("Валюта", Валюта));
					Курс = ЗаписьКурса.Курс;
				Иначе
					Номер = Найти(Текст, "средневзвешенный курс");
					Если Номер = 0 Тогда
						Сообщить("Не найден средневзвешенный курс доллара за " + ФорматДаты + "!");
						текДата = текДата + 24*3600;
						инд = инд + 1;
						НомерПопытки = 0;
						Продолжить;
					Иначе
						Если ЭтоIE8 Тогда
							Текст = Сред(Текст, Номер + 28, 100);
						Иначе
							Текст = Сред(Текст, Номер + 100, 100);
						КонецЕсли;
						Номер = Найти(Текст, "data-title-text="" "">");
						КурсСтрокой = Лев(СокрЛП(Сред(Текст, Номер + 20, 50)), 7);
					КонецЕсли;
					Если Лев(КурсСтрокой, 1) = "-" Тогда
						ЗаписьКурса = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(текДата, Новый Структура("Валюта", Валюта));
						Курс = ЗаписьКурса.Курс;
					Иначе
						Курс = Число(КурсСтрокой);
					КонецЕсли;
				КонецЕсли;
			Исключение
				Сообщить("Ошибка загрузки средневзвешенного курса доллара за " + ФорматДаты + ". " + ОписаниеОшибки());
				Сообщить("Курс строкой - " + КурсСтрокой);
				текДата = текДата + 24*3600;
				инд = инд + 1;
				НомерПопытки = 0;
				Продолжить;
			КонецПопытки;
			ЗаписьКурсовВалют = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
			ЗаписьКурсовВалют.Валюта    = Валюта;
			ЗаписьКурсовВалют.Период    = текДата;
			ЗаписьКурсовВалют.Прочитать();
			ЗаписьКурсовВалют.Валюта    = Валюта;
			ЗаписьКурсовВалют.Период    = текДата;
			ЗаписьКурсовВалют.Курс      = Курс;
			ЗаписьКурсовВалют.Кратность = 1;
			ЗаписьКурсовВалют.Записать();
		Иначе
			Если НомерПопытки < 4 Тогда
				objIE.Quit();
				objIE = Неопределено;
				Попытка
					objIE = Новый COMОбъект("InternetExplorer.Application");
				Исключение
					Сообщить(ОписаниеОшибки()); 
					Возврат;
				КонецПопытки;	
				objIE.Visible = Ложь;
				objIE.Silent = Ложь;
				Продолжить;
			Иначе
				Сообщить("Ошибка загрузки средневзвешенного курса доллара за " + ФорматДаты + ". " + ОписаниеОшибки);
			КонецЕсли;
		КонецЕсли;
		текДата = текДата + 24*3600;
		инд = инд + 1;
		НомерПопытки = 0;
	КонецЦикла;
	
	objIE.Quit();
	objIE = Неопределено;	
	
КонецПроцедуры
//<-

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ИмяФайла = "Curses.txt";  

#КонецЕсли
